//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2011, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//*************************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//*************************************************************************
// Revision History
// ----------------
// $Log: $
// 
//*************************************************************************

//*************************************************************************
//<AMI_FHDR_START>
//
// Name:  PlatformSetupInfo.uni
//
// Description: String Definitions for PlatformSetupInfo form.Some of the
// strings are dynamically updated getting the values from PlatformSetupInfo.c
//
//<AMI_FHDR_END>
//*************************************************************************

/=#
#include "VFR.uni"

//
//PROCESSOR INFORMATION
//
#string STR_BOARD_CPU_FORM_SUBTITLE                     #language eng "Processor Information"

#string STR_BOARD_PROCESSOR_HELP                        #language eng "Displays the Processor Details."
#string STR_BOARD_PROCESSOR_STRING                      #language eng "Name"
#string STR_BOARD_PROCESSOR_VALUE                       #language eng "N/A"

#string STR_BOARD_PROCESSOR_VERSION_HELP                #language eng "Brand String of the Processor"
#string STR_BOARD_PROCESSOR_VERSION_STRING              #language eng "Brand String"
#string STR_BOARD_PROCESSOR_VERSION_VALUE               #language eng "N/A"

#string STR_BOARD_PROCESSOR_SPEED_HELP                  #language eng "Displays the Processor Frequency."
#string STR_BOARD_PROCESSOR_SPEED_STRING                #language eng "Frequency"
#string STR_BOARD_PROCESSOR_SPEED_VALUE                 #language eng "N/A"

#string STR_BOARD_PROCESSOR_ID_HELP                     #language eng "Displays the Processor Stepping."
#string STR_BOARD_PROCESSOR_ID_STRING                   #language eng "Processor ID"
#string STR_BOARD_PROCESSOR_ID_VALUE                    #language eng "N/A"

#string STR_BOARD_PROCESSOR_STEPPING_HELP               #language eng "Displays the Processor Stepping."
#string STR_BOARD_PROCESSOR_STEPPING_STRING             #language eng "Stepping"
#string STR_BOARD_PROCESSOR_STEPPING_VALUE              #language eng "Unknown"

#string STR_BOARD_PROCESSOR_PACKAGE_HELP                #language eng "Displays the Processor Package."
#string STR_BOARD_PROCESSOR_PACKAGE_STRING              #language eng "Package"
#string STR_BOARD_PROCESSOR_PACKAGE_VALUE               #language eng "Not Implemented Yet"

#string STR_BOARD_PROCESSOR_COUNT_HELP                  #language eng "Displays number of CPU cores."
#string STR_BOARD_PROCESSOR_COUNT_STRING                #language eng "Number of Processors"
#string STR_BOARD_PROCESSOR_COUNT_VALUE                 #language eng "xCore(s) / yThread(s)"

#string STR_BOARD_PROCESSOR_MICROCODE_HELP              #language eng "CPU Microcode Revision"
#string STR_BOARD_PROCESSOR_MICROCODE_STRING            #language eng "Microcode Revision"
#string STR_BOARD_PROCESSOR_MICROCODE_VALUE             #language eng "Not loaded"

#string STR_BOARD_PROCESSOR_GT_HELP                     #language eng "Processor GT Info. Only valid if SNB stepping is D0 or above."
#string STR_BOARD_PROCESSOR_GT_STRING                   #language eng "GT Info"
#string STR_BOARD_PROCESSOR_GT_VALUE                    #language eng "Not Applicable"

//
//NB Information
//
#string STR_BOARD_IGFX_VBIOS_REV_HELP                   #language eng "IGFX VBIOS Version"
#string STR_BOARD_IGFX_VBIOS_REV_NAME                   #language eng "IGFX VBIOS Version"
#string STR_BOARD_IGFX_VBIOS_REV_VALUE                  #language eng "N/A"

#string STR_BOARD_MRC_REV_HELP                          #language eng "Memory RC Version"
#string STR_BOARD_MRC_REV_NAME                          #language eng "Memory RC Version"
#string STR_BOARD_MRC_REV_VALUE                         #language eng "N/A"

#string STR_BOARD_MEMORY_SIZE_HELP                      #language eng "Total Memory in the System."
#string STR_BOARD_MEMORY_SIZE_NAME                      #language eng "Total Memory"
#string STR_BOARD_MEMORY_SIZE_VALUE                     #language eng "N/A"

#string STR_BOARD_MEMORY_FREQ_HELP                      #language eng "Displays the Frequency of Memory"
#string STR_BOARD_MEMORY_FREQ_NAME                      #language eng "Memory Frequency"
#string STR_BOARD_MEMORY_FREQ_VALUE                     #language eng "N/A"

//
//SB Information
//
#string STR_BOARD_SB_INFORMATION                        #language eng "PCH Information"

#string STR_BOARD_CHIP_SB_NAME_HELP                     #language eng "PCH Name"
#string STR_BOARD_CHIP_SB_NAME                          #language eng "Name"
#string STR_BOARD_CHIP_SB_VALUE                         #language eng "UnKnown"

#string STR_BOARD_CHIP_SB_SKU_HELP                      #language eng "Intel PCH SKU Name"
#string STR_BOARD_CHIP_SB_SKU_NAME                      #language eng "PCH SKU"
#string STR_BOARD_CHIP_SB_SKU_VALUE                     #language eng "UnKnown"

#string STR_BOARD_CHIP_SB_REV_HELP                      #language eng "PCH Stepping"
#string STR_BOARD_CHIP_SB_REV_NAME                      #language eng "Stepping"
#string STR_BOARD_CHIP_SB_REV_VALUE                     #language eng "UnKnown"

#string STR_BOARD_CHIP_SB_PACKAGE_HELP                  #language eng "PCH Package"
#string STR_BOARD_CHIP_SB_PACKAGE_NAME                  #language eng "Package"
#string STR_BOARD_CHIP_SB_PACKAGE_VALUE                 #language eng "Not Implemented Yet"

#string STR_BOARD_PLATFORM_TXT_HELP                     #language eng "Platform/PCH TXT capability"
#string STR_BOARD_PLATFORM_TXT_NAME                     #language eng "TXT Capability of Platform/PCH"
#string STR_BOARD_PLATFORM_TXT_VALUE                    #language eng "Not Supported"

#string STR_BOARD_LAN_PHY_REV_HELP                      #language eng "Displays LAN PHY Revision."
#string STR_BOARD_LAN_PHY_REV_STRING                    #language eng "LAN PHY Revision"
#string STR_BOARD_LAN_PHY_REV_VALUE                     #language eng "N/A"

#string STR_BOARD_CHIP_EC_REV_HELP                      #language eng "KSC EC Version"
#string STR_BOARD_CHIP_EC_REV_NAME                      #language eng "KSC EC Version"
#string STR_BOARD_CHIP_EC_REV_VALUE                     #language eng "N/A"

#string STR_BOARD_ME_FW_REV_HELP                        #language eng "ME Firmware Version"
#string STR_BOARD_ME_FW_REV_PROMPT                      #language eng "ME FW Version"
#string STR_BOARD_ME_FW_REV_VALUE                       #language eng "N/A"

#string STR_BOARD_ME_FW_SKU_HELP                        #language eng "ME Firmware SKU"
#string STR_BOARD_ME_FW_SKU_PROMPT                      #language eng "ME Firmware SKU"
#string STR_BOARD_ME_FW_SKU_VALUE                       #language eng "N/A"

//
//SPI Clock Frequency
//
#string STR_SPI_CLK_FREQ                                #language eng "SPI Clock Frequency"

#string STR_SPI_DOFR_SUPPORT_HELP                       #language eng "DOFR Enable/Disable"
#string STR_SPI_DOFR_SUPPORT                            #language eng "DOFR Support"
#string STR_SPI_DOFR_SUPPORT_VALUE                      #language eng "N/A"

#string STR_SPI_READ_CLOCK_FREQUENCY_HELP               #language eng "Displays the Read Status Clock Frequeuncy"
#string STR_SPI_READ_CLOCK_FREQUENCY                    #language eng "Read Status Clock Frequency"
#string STR_SPI_READ_CLOCK_FREQUENCY_VALUE              #language eng "N/A"

#string STR_SPI_WRITE_CLOCK_FREQUENCY_HELP              #language eng "Displays the Write Status Clock Frequency"
#string STR_SPI_WRITE_CLOCK_FREQUENCY                   #language eng "Write Status Clock Frequency"
#string STR_SPI_WRITE_CLOCK_FREQUENCY_VALUE             #language eng "N/A"

#string STR_SPI_FAST_READ_FREQUENCY_HELP                #language eng "Displays the Fast Read Clock Frequency"
#string STR_SPI_FAST_READ_FREQUENCY                     #language eng "Fast Read Status Clock Frequency"
#string STR_SPI_FAST_READ_FREQUENCY_VALUE               #language eng "N/A"

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2011, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************